{
  "header": {
    "presentation": "OI 👋 EU SOU NATHAN",
    "stack": "FULL STACK DEVELOPER",
    "experience": "TENHO 21 ANOS SOU DESENVOLVEDOR FULL STACK COM POUCO MAIS DE 6 MESES DE EXPERIÊNCIA TRABALHANDO COMO FREELANCER E ATUANDO NA ÁREA."
  },
  "body": {
    "aboutMe": {
      "title": "Sobre mim",
      "descripion": "Estou atualmente matriculado no curso de Ciência da Computação na Escola Superior Dom Helder Câmara, onde estou imerso no mundo da tecnologia e do aprendizado contínuo. Minhas habilidades técnicas são aprimoradas por um nível técnico de proficiência em inglês. Tenho uma trajetória que abrange projetos variados, desde experiência no desenvolvimento de sistemas até trabalhos independentes em projetos envolvendo tecnologias diversificadas. Estou animado em explorar oportunidades de colaboração em projetos desafiadores e conectar com outros profissionais que compartilham minha paixão pela inovação tecnológica."
    },
    "technologies": {
      "title": "Tecnologias",
      "description": "Minhas habilidades técnicas abrangem diversas tecnologias amplamente utilizadas na indústria, incluindo Java, JavaScript, TypeScript, Node.js e React. Tenho experiência prática em desenvolvimento web, com conhecimento em ferramentas como Git, GitHub, NPM, Composer e bancos de dados como MySQL, PostgreSQL e MongoDB. Além disso, domino tanto o front-end quanto o back-end, incluindo linguagens como PHP e SQL, permitindo contribuir em todas as etapas do desenvolvimento de software."
    },
    "projects": {
      "title": "Projetos",
      "descripion": "Aqui estão alguns dos meus projetos de desenvolvimento web. Estou orgulhoso do trabalho que fiz e espero que você goste de vê-los. Sinta-se à vontade para entrar em contato comigo se tiver alguma dúvida ou comentário."
    }
  },
  "projects": [
    {
      "title": "Rocket NFTs",
      "description": "Rocket NFT é uma deslumbrante landing page estática, criada com HTML e CSS, projetada para introduzir você ao emocionante mundo dos colecionáveis em criptomoedas e tokens não fungíveis (NFTs). Esta página cativante é um portal visualmente atraente, perfeito para explorar o conceito de NFTs e capturar sua imaginação.",
      "technologies": [
        "HTML",
        "CSS"
      ],
      "link": "https://nathanmarques2001.github.io/Rocket-NFT/"
    },
    {
      "title": "Britaldo Estoque",
      "description": "O Britaldo Estoque é uma aplicação web desenvolvida com o propósito de auxiliar a Escola Britaldo Soares no gerenciamento de seu estoque de materiais. A aplicação foi construída utilizando tecnologias como ReactJS e Firebase, incorporando um sistema de autenticação e autorização. Isso permite que os usuários se cadastrem e efetuem login, e, de acordo com seus níveis de acesso, tenham acesso a funcionalidades específicas.",
      "technologies": [
        "HTML",
        "CSS",
        "JavaScript",
        "ReactJS",
        "Firebase",
        "Firestore",
        "NodeJS"
      ],
      "link": "https://britaldo-estoque.web.app/"
    },
    {
      "title": "Pokédex",
      "description": "A Pokédex é uma aplicação que fornece informações sobre os Pokémon selecionados pelo usuário. Esta Pokédex inclui Pokémon até a quarta geração, até o número 493. O projeto foi desenvolvido com o objetivo de aprimorar as habilidades com o framework ReactJS e o consumo de APIs.",
      "technologies": [
        "HTML",
        "CSS",
        "JavaScript",
        "ReactJS",
        "PokéAPI"
      ],
      "link": "https://nathanmarques2001.github.io/Pokedex/"
    },
    {
      "title": "Habits",
      "description": "Habits é um aplicativo para o controle de seus hábitos diários. Ele permite adicionar, concluir, editar e excluir hábitos, com o progresso visualizado por meio de pequenos quadrados que se fortalecem à medida que você completa seus hábitos, semelhante aos commits do Github.",
      "technologies": [
        "Typescript",
        "ReactJS",
        "React Native",
        "Prisma",
        "NodeJS"
      ],
      "link": "https://github.com/NathanMarques2001/Habits"
    }
  ]
}